espressif/esp-adf/adf_examples/ai_agent/coze_ws_app/sdkconfig.defaults.esp32c6
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_RISCV=y
CONFIG_IDF_TARGET="esp32c6"
CONFIG_IDF_TARGET_ESP32c6=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_lite.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_lite.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table
